src/InformationRegisters/УдалитьШтрихкодыТоваровСХарактеристиками/УдалитьШтрихкодыТоваровСХарактеристиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьШтрихкодыТоваровСХарактеристиками</name>
  <comment>Временное решение для инвентаризации.</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <comment>Ссылка пустая для штрихкодов без номенклатуры.</comment>
    <type>
      <types>CatalogRef.НоменклатураРозница</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеХарактеристики</name>
    <comment>Нужно до тех пор, пока нет справочника для характеристик.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторХарактеристики</name>
    <comment>Нужно до тех пор, пока нет справочника для характеристик.</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УдалитьШтрихкодыТоваровСХарактеристиками/RecordSetModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура удаляет штрихкод из регистра сведений.
// 
// Параметры:
//  Документ - ДокументСсылка.ПересчетТоваров
//  Номенклатура - СправочникСсылка.НоменклатураРозница
//  УникальныйИдентификаторХарактеристики - УникальныйИдентификатор
Процедура УдалитьТоварСХарактеристикой(Знач Документ, Знач Номенклатура, Знач УникальныйИдентификаторХарактеристики) Экспорт

    Отбор.Документ.Установить(Документ);
    Отбор.УникальныйИдентификаторХарактеристики.Установить(УникальныйИдентификаторХарактеристики);
    Прочитать();

    ИндексыЗаписейДляУдаления = Новый Массив; // Массив из Число

    Для ИндексЗаписи = 0 По Количество() - 1 Цикл

        Если Получить(ИндексЗаписи).Номенклатура = Номенклатура Тогда

            ИндексыЗаписейДляУдаления.Вставить(0, ИндексЗаписи);

        КонецЕсли;

    КонецЦикла;

    Для Каждого Индекс Из ИндексыЗаписейДляУдаления Цикл

        Удалить(Индекс);

    КонецЦикла;

    Записать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура обновляет реквизит ДатаИзменения.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ПередЗаписью(Отказ, Замещение)

    Если ОбменДанными.Загрузка Тогда

        Возврат;

    КонецЕсли;

    Для Каждого Запись Из ЭтотОбъект Цикл

        Запись.ДатаИзменения = ТекущаяДатаСеанса();

    КонецЦикла;

КонецПроцедуры

#КонецОбласти
